jalajnagar88-stack/NevOS/targets/esp32s3/sdkconfig.defaults
# NEVOS ESP32-S3-WROOM-1-N16R8 defaults.
# Anything set here is a deliberate choice; see ARCHITECTURE.md §5 and §6.

CONFIG_IDF_TARGET="esp32s3"

# 16 MB flash, A/B OTA layout from partitions.csv
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# 8 MB octal PSRAM at 80 MHz. The framebuffer and the blob pool live here.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# 1 ms tick: the render loop paces to a 33 ms budget and a 10 ms tick would
# quantise that badly.
CONFIG_FREERTOS_HZ=1000

# Both cores: core 1 renders, core 0 carries radios and audio (ARCHITECTURE.md §4).
CONFIG_FREERTOS_UNICORE=n

# Stack overflow must be loud, not mysterious.
CONFIG_FREERTOS_CHECK_STACKOVERFLOW_CANARY=y
CONFIG_ESP_SYSTEM_PANIC_PRINT_REBOOT=y
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
CONFIG_ESP_COREDUMP_DATA_FORMAT_ELF=y

CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_COMPILER_WARN_WRITE_STRINGS=y
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

#
# LVGL reads config/lv_conf.h, the same file the simulator uses.
#
# This has to be said explicitly, and it is the single most important line in
# this file. LVGL's ESP-IDF component defaults CONFIG_LV_CONF_SKIP to y, which
# makes it ignore lv_conf.h entirely and build from Kconfig instead. The device
# would then have had a different LVGL from the simulator — different fonts,
# a different memory ceiling, a different colour depth — while both builds went
# green and the difference showed up only as a device that looked wrong.
#
# It surfaced as `lv_font_montserrat_28 undeclared`: the shell draws every app
# icon in it, the simulator has it, and Kconfig's defaults do not.
#
CONFIG_LV_CONF_SKIP=n
